In [1]:
import pandas as pd

In [2]:
# Q1. Create a DataFrame with 3 columns: 'Name', 'Age', and 'Score'
# Add at least 3 rows of your choice.

dataset = pd.DataFrame({"Name" : ["Kool", "Dude", "Sufi"], "Age" : [45, 15, 60], "Scores": [90, 80, 56]})
print(dataset)

   Name  Age  Scores
0  Kool   45      90
1  Dude   15      80
2  Sufi   60      56

In [3]:
# Q2. Select the 'Age' column from the DataFrame you just created.

age = dataset["Age"]
age

0    45
1    15
2    60
Name: Age, dtype: int64

In [4]:
# Q3. Filter the DataFrame to include only rows where Age > 25.

age_filter = dataset[dataset["Age"] > 25]
age_filter

   Name  Age  Scores
0  Kool   45      90
2  Sufi   60      56

In [6]:
# Q4. Add a new column 'Pass' where Score > 50 is considered True.

dataset.loc[dataset["Scores"] > 50, "Idk"] = "Pass"

print(dataset)

   Name  Age  Scores   Idk
0  Kool   45      90  Pass
1  Dude   15      80  Pass
2  Sufi   60      56  Pass

In [8]:
# Q5. Drop the 'Score' column from your DataFrame.

dataset.drop("Scores", axis = 1, inplace = True)
dataset

   Name  Age   Idk
0  Kool   45  Pass
1  Dude   15  Pass
2  Sufi   60  Pass

In [9]:
# Q6. Use .describe() to get summary statistics of your DataFrame.

dataset.describe()

             Age
count   3.000000
mean   40.000000
std    22.912878
min    15.000000
25%    30.000000
50%    45.000000
75%    52.500000
max    60.000000

In [ ]:
# Q7. Read a CSV file using Pandas (assume file name is data.csv).

# dataset1 = pd.read_csv(r"C:\Users\sscomputers\Desktop\30 Days\Day 2\Real estate.csv")
# dataset1.head(5)

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2
2,3,2013.583,13.3,561.98450,5,24.98746,121.54391,47.3
3,4,2013.500,13.3,561.98450,5,24.98746,121.54391,54.8
4,5,2012.833,5.0,390.56840,5,24.97937,121.54245,43.1

In [23]:
# Q8. Group a DataFrame by 'Department' and find the average salary.
# (Assume a DataFrame with 'Department' and 'Salary' columns.)

dataset["Department"] = ["Finance", "Finance", "HR"]
dataset["Salary"] = [100000, 50000, 70000]
dataset["ID"] = [6, 2, 3]
# avg = dataset.groupby("Department")["Salary"].mean()
# avg
dataset

   Name  Age   Idk Department  Salary  ID
0  Kool   45  Pass    Finance  100000   6
1  Dude   15  Pass    Finance   50000   2
2  Sufi   60  Pass         HR   70000   3

In [24]:
#Q9. Merge two DataFrames on a common column called 'ID'.

dataset1 = pd.DataFrame({"Name": ["Helo", "Bye"], "ID" : [10, 6]})

new = pd.merge(dataset, dataset1, on="ID", how="inner")
new

  Name_x  Age   Idk Department  Salary  ID Name_y
0   Kool   45  Pass    Finance  100000   6    Bye